

"OldNews": [
  {"Date":"9/18/2019","Text":"Added a reset button to the Design Wrap Page. If the color of the address numbers is changed, the color will persist when the wrap design is changed UNTIL the reset button is pressed. Then the default colors will display.\n\nMade the page scroll on the Design Wrap Page so that at the end of the list going forward, it cycles back to the beginning, and at the beginning of the list going backwards, it cycles back to the end of the list.\n\nFixed the IOS design wrap page so it now works! Yaaaaaay!!\n\nFixed product scrolling so the numbers stay in the same position on the wrap."},
  {"Date":"9/13/2019", "Text":"Updated the size and the look of the application icon.\n\nFlushed out differences between IOS and Android.\n\nOnly issue now is the Design Wrap page does not work on IOS."},
  {"Date":"9/11/2019","Text":"Started work on IOS version of app. Flushing out inconsistencies between the two - colors, formatting etc.\n\nFixed color issues in the IOS application."},
  {"Date":"9/07/2019", "Text":"Implemented fundraising logic.\n\nGo into the profile tab and remove your first name. Then exit the app. This will put it into unregistered mode so you can see what the menu will look like when first opened.\n\nEnter a Fundraiser code in the fundraiser tab - the data in the fundraiser category will then filter by institution.\n\nCodes are SCHOOL1 which expires 9/15 (midnight), SCHOOL2 which expires on 9/15 and SCHOOL3 which expired on 8/29.\n\nFundraiser category will only display if person is set up as a fundraiser.\n\nSalesrep menus will not display to a fundraiser, and visa versa.\n\nFixed the issue with the page scrolling when trying to move the numbers. Navigation to previous and next pages has to be done now using the back and forward buttons. Scrolling using the swipe will be re-implemented once the bug in the Android code is fixed.\n\n"},
  {"Date":"8/27/2019","Text":"Implemented activity indicator for long running processes.\n\nAdded new resized images for Cities and Country Flags categories.\n\nAdded scroll buttons to the design page. Touching them will manually scroll the pages. This is also a visual indicator; the user can also swipe pages left and right.\n\nModified Shipping info page to allow user to select shipping method.\n\nModified customization page so that wrap image expands to fill the screen, giving a larger image for the customer to view."},
  {"Date":"8/23/2019","Text":"Changed app over to new colors and logo."},
  {"Date":"8/22/2019","Text":"Added new categories.\n\nUpdated app with all resized images.\n\n"},
  {"Date":"8/21/2019","Text":"Adjusted the display of both the categories page as well as the category lists so they display properly in both horizontal and vertial orientation.\n\nAdded activity indicators in case loading takes too long.\n\nAdded the Beaches, Cities, Country, Flowers, Forest and Hobbies categories.\n\nUpdate the military category.\n\n"},
  {"Date":"8/19/2019", "Text":"Added a picker for state abbreviations as well as for month and year(card expiration).\n\nAdded registration functionality into the app. If you go to the register page in the menu and enter your first and last name and click through to the end of the registration process, it will consider you registered so you can see what the registration process will look like and how the menu changes. Ultimately, all fields will need to be valid in the registration profile.\n\nAdded Animals and Insects categories.\n\n"},
  {"Date":"8/15/2019", "Text":"Added a splash screen to the application. \n\nFixed the colors of the top menu bar. \n\nChanged the color of the button in the 'Choose Wrap' pages so it matches the theme. \n\n"},
  {"Date":"8/14/2019", "Text":"Added a menu, restructured application to use the menu. \n\nAdded a News page and made it the home page. When not subscribed, only this page and the about page will be loadable. \n\nAlso added the Custom category, and added rounded corners to the category buttons. \n\nMade style changes for application consistency. \n\nFixed the pink text on the change color page. \n\nAdded an 'About' page - let me know what text you want there. All prices in this page are loaded dynamically, so they can be changed any time."}
]